[
    {
        "id": "simple_1",
        "name": "Simple Statement",
        "category": "Simple",
        "text": "The officer deliberately grabbed my arm."
    },
    {
        "id": "simple_2",
        "name": "Basic Claim",
        "category": "Simple",
        "text": "He obviously wanted to hurt me when he pushed me against the wall."
    },
    {
        "id": "simple_3",
        "name": "Intent Attribution",
        "category": "Simple",
        "text": "The cop intentionally twisted my wrist to cause pain."
    },
    {
        "id": "medium_1",
        "name": "Quote with Context",
        "category": "Medium",
        "text": "Officer Smith yelled \"Stop resisting!\" but I wasn't resisting at all. He clearly said that to justify his brutal attack on me."
    },
    {
        "id": "medium_2",
        "name": "Multiple Events",
        "category": "Medium",
        "text": "First, the thug cop grabbed me without warning. Then his partner, badge number 4821, deliberately slammed me against their cruiser. They obviously coordinated this assault on January 15th around 9 PM near Main Street."
    },
    {
        "id": "medium_3",
        "name": "Quote and Emotional Language",
        "category": "Medium",
        "text": "I politely asked \"What's the problem, officer?\" and he viciously attacked me for no reason. His psychotic partner just watched and laughed. They wanted to terrorize me."
    },
    {
        "id": "hard_1",
        "name": "Complex Narrative",
        "category": "Hard",
        "text": "On January 15th, 2026 at approximately 11:30 PM, I was walking home from my job at the Riverside Cafe when Officer Jenkins, badge number 4821, stopped me. He yelled \"Stop right there!\" I asked \"What's the problem, officer?\" He intentionally grabbed my arm and twisted it behind my back. I said \"You're hurting me!\" but he obviously didn't care. His partner Officer Rodriguez, badge number 5539, searched my pockets without consent. My neighbor Marcus witnessed everything."
    },
    {
        "id": "hard_2",
        "name": "Legal Conclusions",
        "category": "Hard",
        "text": "The officers committed assault and battery, false imprisonment, and civil rights violations. Officer Jenkins has a history of brutality complaints. The department is covering up his crimes. I was illegally detained without probable cause and my Fourth Amendment rights were violated."
    },
    {
        "id": "hard_3",
        "name": "Multiple Witnesses",
        "category": "Hard",
        "text": "Officer Davis deliberately threw me to the ground on Oak Avenue. Witness John Smith, who was walking his dog, saw everything and yelled \"That's police brutality!\" Mrs. Chen from across the street called 911. The responding sergeant, Williams badge 2103, obviously tried to cover it up by saying \"There's been a misunderstanding.\""
    },
    {
        "id": "huge_1",
        "name": "Complete Incident Report",
        "category": "Huge",
        "text": "I was absolutely terrified and in complete shock when the brutal, psychotic cops viciously attacked me for absolutely no reason on January 15th, 2026 at around 11:30 PM near the corner of Main Street and Oak Avenue.\n\nIt all started when I was innocently walking home from my job at the Riverside Cafe where I work as a server. I was exhausted after pulling a double shift and just wanted to get home to my apartment. Out of nowhere, this unmarked police cruiser came screeching up beside me with its lights flashing aggressively. The thug cop behind the wheel was clearly looking for trouble.\n\nOfficer Jenkins, badge number 4821, jumped out of the car like a maniac and immediately started screaming at me. He yelled \"STOP RIGHT THERE! DON'T YOU DARE MOVE!\" I was so scared I froze in place. I asked him politely \"What's the problem, officer? I haven't done anything wrong.\" He obviously didn't care about my rights or the law.\n\nHis partner, Officer Rodriguez, badge number 5539, got out of the passenger side and they both approached me with their hands on their weapons, clearly ready to shoot me for no reason. Officer Jenkins deliberately grabbed my left arm with excessive force and twisted it behind my back. I screamed in pain and said \"You're hurting me! Please stop!\" but he intentionally ignored my pleas because he wanted to inflict maximum damage.\n\nOfficer Rodriguez then searched through my pockets without my consent and without any legal justification. He was fishing through my belongings like a criminal. He found my wallet, my phone, and my work apron that still had some cash tips from my shift. He accused me of being a robbery suspect which was a complete and total lie fabricated to justify their illegal assault on me.\n\nI tried to explain \"I just got off work at the Riverside Cafe! You can call my manager Sarah Mitchell to verify!\" but Officer Jenkins just laughed in my face and said \"Sure you did, that's what they all say.\" He was mocking me and clearly enjoying my suffering.\n\nThey then brutally slammed me against their patrol car, and Officer Rodriguez put handcuffs on me so tightly that they cut into my wrists. I have permanent scars from their torture. While my face was pressed against the cold metal of the car, Officer Jenkins whispered menacingly in my ear \"You should have just cooperated, now you're going to pay for wasting our time.\" This was clearly a threat and witness intimidation.\n\nMy neighbor, Marcus Johnson, happened to be walking his dog and witnessed the entire horrifying assault. He started recording on his phone and yelled \"Hey! What are you doing to him? That's my neighbor, he's not a criminal!\" Officer Rodriguez immediately ran over to Marcus and tried to grab his phone, but Marcus stepped back. Rodriguez threatened him saying \"You better delete that video or you're next.\" This is clearly obstruction of justice and intimidation of a witness.\n\nAnother witness, an elderly woman named Mrs. Patricia Chen who lives across the street, came out onto her porch and also saw everything. She called 911 to report that police officers were assaulting an innocent person.\n\nAfter holding me against the car for what felt like hours but was probably about 20 minutes, a sergeant arrived at the scene. Sergeant Williams, badge number 2103, pulled Officers Jenkins and Rodriguez aside and they had a hushed conversation. I couldn't hear what they were saying, but they kept looking at me and shaking their heads. It was obvious they were conspiring about how to cover up their crimes.\n\nEventually, Sergeant Williams came over to me and said \"There's been a misunderstanding. You can go.\" He uncuffed me but didn't apologize for their criminal behavior. My wrists were bleeding and bruised. I asked \"Am I being charged with anything?\" and he just said \"Not today\" which was clearly a threat that they would fabricate charges against me later if I complained.\n\nI went to the emergency room at St. Mary's Hospital immediately after and was treated by Dr. Amanda Foster. She documented bruises on both wrists, a sprained left shoulder from when Jenkins twisted my arm, and minor abrasions on my face from being slammed against the car. She said my injuries were consistent with \"significant physical force\" which proves they used excessive and unnecessary violence against me."
    },
    {
        "id": "huge_2",
        "name": "Multi-Day Investigation",
        "category": "Huge",
        "text": "INCIDENT SUMMARY - Case #2026-0115-A\n\nDay 1 - January 15th, 2026:\nAt approximately 2:15 PM, I was driving my vehicle, a blue 2019 Honda Civic with license plate ABC-1234, eastbound on Highway 101 near exit 42 when I was pulled over by two patrol cars. The first officer, Corporal Davis (badge 7892), approached my driver's side window while his partner Officer Kim (badge 6234) stood by the passenger side with his hand on his weapon.\n\nCorporal Davis immediately demanded \"Step out of the vehicle NOW!\" I calmly asked \"Can you tell me why I'm being stopped?\" He refused to answer and instead yanked my door open. He intentionally grabbed my shirt collar and dragged me out of my car. I said \"I'm cooperating, there's no need for force!\" but he clearly wanted to escalate the situation.\n\nOfficer Kim began searching my vehicle without my consent and without a warrant. He was deliberately destroying my property, throwing items onto the highway. He found a prescription medication bottle and immediately accused me of drug possession even though the bottle clearly had my name and my doctor's information on it. This was obvious harassment.\n\nThey detained me for approximately 3 hours on the side of the highway while waiting for a K-9 unit. The dog handler, Officer Martinez (badge 5567), arrived with a German Shepherd that supposedly \"alerted\" on my vehicle. I know for a fact this was a false alert because there were no drugs in my car. The entire K-9 alert was fabricated to justify an illegal search.\n\nAfter finding nothing illegal, they finally let me go but issued me three bogus citations: speeding (I was going exactly the speed limit), failure to signal (I did signal), and an expired registration (my registration was valid until March 2026). These were clearly retaliatory tickets designed to punish me for asking questions.\n\nDay 2 - January 16th, 2026:\nI went to the police station at 9:00 AM to file a formal complaint. The desk sergeant, Sergeant Thompson (badge 3345), was dismissive and rude. He said \"Officers have discretion\" and refused to give me a complaint form. I asked to speak to a supervisor and he said \"I AM the supervisor\" which was obviously a lie because sergeants are not the highest ranking officers.\n\nI eventually obtained a complaint form from the Internal Affairs office after waiting for 2 hours. Detective Monroe took my statement but I could tell from her body language that she had already decided to side with the officers.\n\nDay 3 - January 17th, 2026:\nI consulted with attorney Jennifer Walsh at the Civil Rights Legal Foundation. She reviewed my case and said it was \"one of the clearest cases of harassment she had seen in 20 years.\" We began documenting everything for a federal civil rights lawsuit under 42 U.S.C. ยง 1983.\n\nI also obtained dashcam footage from a witness, truck driver Robert Williams, who had been behind me on Highway 101 and recorded the entire traffic stop. His footage clearly shows Corporal Davis grabbing me aggressively and Officer Kim throwing my belongings on the ground.\n\nDay 5 - January 19th, 2026:\nI received a threatening phone call from an unknown number. A male voice said \"Drop the complaint or there will be consequences.\" I reported this to the FBI as witness intimidation. They assigned Agent Sarah Chen to investigate possible civil rights violations by the department.\n\nThe pattern of abuse by this department is systematic and ongoing. I have since connected with 15 other victims who have experienced similar harassment from the same officers."
    },
    {
        "id": "huge_3",
        "name": "Hospital Incident with Medical Details",
        "category": "Huge",
        "text": "VICTIM STATEMENT - Medical Incident #MH-2026-0892\n\nOn February 3rd, 2026, I was admitted to Metropolitan General Hospital for a scheduled minor surgical procedure (appendectomy). What should have been a routine one-night stay turned into a nightmare of medical malpractice and deliberate negligence.\n\nPre-Operative Issues (7:00 AM - 10:00 AM):\nI arrived at the hospital at 7:00 AM as instructed and was taken to Pre-Op Room 4B. Nurse Practitioner Williams reviewed my chart and immediately noticed that my allergies were not properly documented. I am severely allergic to penicillin and sulfa drugs - I have told them this multiple times on every form I filled out. She promised to \"fix it\" but I later discovered she never updated the system.\n\nThe anesthesiologist, Dr. Marcus Chen, was clearly rushed and barely looked at my chart. He asked \"Any allergies?\" and I clearly stated \"Penicillin and sulfa - I'm severely allergic, I could die.\" He nodded and wrote something down but he obviously wasn't really paying attention.\n\nSurgical Issues (10:30 AM - 12:15 PM):\nThe surgery was supposed to be performed by Dr. Elizabeth Foster, a surgeon I had specifically requested because of her excellent reputation. Instead, a different surgeon, Dr. Robert Hayes, performed the procedure. NO ONE told me about this substitution. I never consented to having Dr. Hayes operate on me. This is a clear violation of informed consent laws.\n\nPost-Operative Nightmare (12:30 PM - 8:00 PM):\nI woke up in Recovery Room C with severe nausea and difficulty breathing. The recovery nurse, RN Patricia Kim, checked my vitals and said \"Everything looks fine\" but I was clearly not fine. I told her \"Something is wrong, I can't breathe properly\" but she dismissed my concerns and said \"You're just anxious from the anesthesia.\"\n\nAt approximately 2:45 PM, another nurse, RN David Martinez, came to administer my post-operative antibiotics. He gave me an IV injection and within 5 minutes, I broke out in hives all over my body and my throat started closing. I was going into anaphylactic shock. He had given me SULFA ANTIBIOTICS despite my clearly documented allergy.\n\nI tried to yell for help but my throat was closing. RN Martinez panicked and ran out of the room instead of calling a code. I pressed the call button repeatedly but no one came for at least 3 minutes - which felt like an eternity when you can't breathe.\n\nFinally, another patient's family member, Mrs. Sarah Thompson from Room 312, heard my distress and ran to get help. She literally saved my life. The crash team arrived and administered epinephrine. I was transferred to the ICU where I spent the next 4 days recovering from the allergic reaction on top of my surgery.\n\nICU Stay - February 3rd-7th:\nDuring my ICU stay, I witnessed further negligence. Night shift nurses routinely skipped hourly check-ins. On February 5th, my IV became dislodged and I was bleeding for at least 30 minutes before anyone noticed. I had to use the call button 6 times before someone came.\n\nDr. Hayes visited once, on February 4th, and spent exactly 2 minutes in my room. He said \"These things happen\" when I confronted him about the allergy mistake. He showed no remorse whatsoever. He was clearly more concerned about liability than my wellbeing.\n\nThe hospital's risk management team, led by Director James Morrison, came to my room on February 6th with a \"settlement offer\" and a non-disclosure agreement. They offered me $15,000 to sign away my rights to sue. I refused. Morrison said \"You should take it, medical malpractice cases are hard to win.\" This was clearly an attempt to intimidate me into accepting a lowball offer.\n\nPost-Discharge Issues - February 7th onwards:\nI was discharged on February 7th but continued to experience complications. My surgical incision became infected (probably because of the chaos around my allergic reaction and the resulting lack of proper wound care). I had to be readmitted on February 12th for IV antibiotics and wound care.\n\nI have since filed complaints with the State Medical Board against Dr. Hayes for operating without proper consent, against RN Martinez for administering medication I was allergic to, and against the hospital for systemic failures in documentation and care protocols.\n\nMy attorney, David Chen of Chen & Associates Medical Malpractice Law, has filed a lawsuit seeking damages for medical negligence, lack of informed consent, and intentional infliction of emotional distress. Expert witnesses Dr. Michelle Wu (patient safety specialist) and Dr. Robert Kim (allergist) have reviewed my case and confirmed multiple standard-of-care violations."
    },
    {
        "id": "very_huge_1",
        "name": "Incident with Psychotic cop",
        "category": "Very Huge",
        "text": "I was absolutely terrified and in complete shock when the brutal, psychotic cops viciously attacked me for absolutely no reason on January 15th, 2026 at around 11:30 PM near the corner of Main Street and Oak Avenue.It all started when I was innocently walking home from my job at the Riverside Cafe where I work as a server. I was exhausted after pulling a double shift and just wanted to get home to my apartment. Out of nowhere, this unmarked police cruiser came screeching up beside me with its lights flashing aggressively. The thug cop behind the wheel was clearly looking for trouble.Officer Jenkins, badge number 4821, jumped out of the car like a maniac and immediately started screaming at me. He yelled \"STOP RIGHT THERE! DON'T YOU DARE MOVE!\" I was so scared I froze in place. I asked him politely \"What's the problem, officer? I haven't done anything wrong.\" He obviously didn't care about my rights or the law.His partner, Officer Rodriguez, badge number 5539, got out of the passenger side and they both approached me with their hands on their weapons, clearly ready to shoot me for no reason. Officer Jenkins deliberately grabbed my left arm with excessive force and twisted it behind my back. I screamed in pain and said \"You're hurting me! Please stop!\" but he intentionally ignored my pleas because he wanted to inflict maximum damage.Officer Rodriguez then searched through my pockets without my consent and without any legal justification. He was fishing through my belongings like a criminal. He found my wallet, my phone, and my work apron that still had some cash tips from my shift. He accused me of being a robbery suspect which was a complete and total lie fabricated to justify their illegal assault on me.I tried to explain \"I just got off work at the Riverside Cafe! You can call my manager Sarah Mitchell to verify!\" but Officer Jenkins just laughed in my face and said \"Sure you did, that's what they all say.\" He was mocking me and clearly enjoying my suffering.They then brutally slammed me against their patrol car, and Officer Rodriguez put handcuffs on me so tightly that they cut into my wrists. I have permanent scars from their torture. While my face was pressed against the cold metal of the car, Officer Jenkins whispered menacingly in my ear \"You should have just cooperated, now you're going to pay for wasting our time.\" This was clearly a threat and witness intimidation.My neighbor, Marcus Johnson, happened to be walking his dog and witnessed the entire horrifying assault. He started recording on his phone and yelled \"Hey! What are you doing to him? That's my neighbor, he's not a criminal!\" Officer Rodriguez immediately ran over to Marcus and tried to grab his phone, but Marcus stepped back. Rodriguez threatened him saying \"You better delete that video or you're next.\" This is clearly obstruction of justice and intimidation of a witness.Another witness, an elderly woman named Mrs. Patricia Chen who lives across the street, came out onto her porch and also saw everything. She called 911 to report that police officers were assaulting an innocent person. I later found out that her call was mysteriously \"lost\" in the system, which proves there's a massive cover-up going on.After holding me against the car for what felt like hours but was probably about 20 minutes, a sergeant arrived at the scene. Sergeant Williams, badge number 2103, pulled Officers Jenkins and Rodriguez aside and they had a hushed conversation. I couldn't hear what they were saying, but they kept looking at me and shaking their heads. It was obvious they were conspiring about how to cover up their crimes.Eventually, Sergeant Williams came over to me and said \"There's been a misunderstanding. You can go.\" He uncuffed me but didn't apologize for their criminal behavior. My wrists were bleeding and bruised. I asked \"Am I being charged with anything?\" and he just said \"Not today\" which was clearly a threat that they would fabricate charges against me later if I complained.I went to the emergency room at St. Mary's Hospital immediately after and was treated by Dr. Amanda Foster. She documented bruises on both wrists, a sprained left shoulder from when Jenkins twisted my arm, and minor abrasions on my face from being slammed against the car. She said my injuries were consistent with \"significant physical force\" which proves they used excessive and unnecessary violence against me.The next day, I filed a formal complaint with the Internal Affairs Division. Detective Sarah Monroe took my statement, but I could tell from her dismissive attitude that she wasn't going to do anything about it. She said \"We'll investigate\" but I know they always protect their own. Three months later, I received a letter stating that my complaint had been investigated and the officers' actions were found to be \"within policy.\" This is an obvious whitewash and cover-up.I was never charged with any crime, which proves I was completely innocent and they had absolutely no legal basis to stop me in the first place. This was clearly racial profiling and harassment. The so-called \"robbery suspect\" they claimed I matched turned out to be a description of a white male in his 40s - I am a 28-year-old Black man. The racism in this department is systematic and institutionalized.The psychological trauma from this attack has been devastating. I now suffer from PTSD, anxiety, and depression. I can no longer walk outside at night without having panic attacks. My therapist, Dr. Michael Thompson, has diagnosed me with Post-Traumatic Stress Disorder directly caused by this police brutality incident. I've lost my job because I couldn't show up to my night shifts anymore due to my fear of going outside after dark.Officer Jenkins is a known violent offender with a history of brutality complaints against him. I researched his record and found that at least 12 other citizens have filed complaints against him for similar behavior. The police department refuses to release his full disciplinary record, which proves they are hiding even more evidence of his pattern of violence and abuse of power.I am now pursuing legal action against the City Police Department, Officers Jenkins and Rodriguez, Sergeant Williams, and the City itself for civil rights violations, assault and battery, false imprisonment, intentional infliction of emotional distress, and conspiracy to violate my constitutional rights. My attorney, Jennifer Walsh from the Civil Rights Legal Foundation, says this is one of the clearest cases of police misconduct she has ever seen.The whole system is corrupt and designed to protect violent cops while victimizing innocent citizens like myself. Until there is real accountability and reform, these thugs with badges will continue to terrorize our communities with impunity. I refuse to be silenced and I will fight for justice no matter how long it takes."
    }
]